{
    "General": {
        "name": "General",
        "general": {
            "name": "General",
            "text": [
                "Welcome to the exiting Φ world! Please confirm your Φclient is connected to Φnetwork and the blocks count is growing.(see instructions below)",
                "It needs 10-30 minutes for downloading initial data before you can browse Φ contents. During this time period, please have a look at the basic introductions for Φ system below.",
                "<div class='ph' />",
                "<h3>Functions :</h3>",
                "The Φ system is designed to be the next generation internet. The Desktop Client version 2.0 covers many functions in different areas. Here is a basic introduction for each function modules:",
                "<b>Browse (Browser):</b>",
                "Contents published on Φ system can be browsed in ΦBrowser page. You may follow anyone and review his/her latest publications. Personal blog page is also supported.",
                "<b>Publish (Publisher):</b>",
                "If you want to have your own footprint on the Φ system, use the \" Publish\"  function on ΦBrowser or ΦPublisher. It is possible to publish text, file, link or even an app. Sharing links and commenting on contents are also supported.",
                "<b>Chat (Messenger):</b>",
                "If you want to communicate with others privately on Φ system, please use the ΦMessenger. All messages are encrypted and only can be viewed by sender and receiver.",
                "<b>Get Φcoins (Miner) :</b>",
                "Publication and chat on Φ system needs Φcoins to pay network fee. Simplest and cheapest way to get Φcoins is to mine some Φcoins by ΦMiner. Of course you may also buy Φcoins from others.",
                "<b>Manage Φcoins (Wallet) :</b>",
                "In ΦWallet you can view balance, transaction history and send Φcoins.",
                "<b>Sell and purchase products (Shop) :</b>",
                " ΦShop allows you to publish products for selling or to buy products using Φcoin.",
                "<b>Account management (Account menu) :</b>",
                "Publishing contents, chatting, sending and receiving Φcoins, are all based on a Φaccount (ΦID) owned by user. To create, encrypt and export your account, please go to \"Account\" menu.",
                "<b>Domain management :</b>",
                "Domain will make your blog/shop/ID more distinguishable. Domain management button is under \"Account\" menu.",
                "<b>Apps management :</b>",
                "ΦApps page is designed for you to download and upgrade apps.",
                "<div class='ph' />",
                "<h3>Working environment :</h3>",
                "Internet access is a MUST for working with Φ system.",
                "It'd better to use a public IP address because you can link to more Φnodes and get latest Φ data faster.",
                "At least one connection to any node of the Φ network is needed. (The connections count is shown on bottom-right of your client window). In any case you lost the connection to the Φ  network, simply collect node IPs from friends or web search and add nodes via the \"add node\" function in  Menu->Applications->Tools. ",
                "It is better NOT to put your working directory in the same partition with operating system. To change data dir, use the shortcut with -choosedatadir in the package.",
                "Many websites require Adobe Flash installed to play video. To install flash, goto http://www.flash.com , and follow the instructions.",
                "<div class='ph' />",
                "<h3>Terminologies :</h3>",
                "Φ represents the FAI system, FAI technology.",
                "φ is the symbol for Φcoins.φ1 means one Φcoin.",
                "ΦID: a ΦID is the namekey (pubkey) of a Φaccount. It's a unique identification (no duplicates in the universe). It represents its owner (person, organization, or computer) in Φ system. ΦID is used for receiving Φcoins or messages. ΦID is usually 60 bytes long.",
                "Φaccount: a Φaccount  consists a namekey (ID or pubkey) and privatekey, and optionally, a password which encrypts it. Each account has an independent account file.",
                "Φdomain: The domains with extension .f or .fai. Φ domain is similar to ICANN domains, but without any central registrar. So a Φdomain has more freedom and flexibility, it can be redirected to a ΦID, a Φlink or even a normal http link.",
                "Φtransaction: A batch of automatic-executing Φ commands signed by Φaccounts. A Φtransaction has a unique Φlink, and a unique ID called txid. A transaction includes a series of inputs of Φcoins, and a series of outputs of Φcoins and/or contents.",
                "Φminer/mining: Using computer calculating power to try confirming Φtransactions. For each successful confirmation, you will be awarded the network fees of the Φtransactions confirmed.",
                "Φfee: The fee paid to Φnetwork for Φtransaction sent. Minimum fee rate is  φ1 per kilo bytes length.",
                "Φblock: A batch of confirmed Φtransactions. Each Φblock has a unique Id called Φblock hash, and a Φblock time when it's created. ΦBlocks are created one by one, so each Φblock has a blockheight.",
                "Φblock height: The serie number of a Φblock in the blockchain (started from 0).",
                "Φcoinbase: The Φtransaction to receive Φnetwork fees.",
                "Φlink: A link represents the content of an output of Φtransaction. The content can be retrieved easily by its link. Template: fai:blockheight.ntx.nout, examples: 0.0.1 or fai:10000.1.",
                "ΦLocktime: The time of Φcoins in a Φtransaction output locked before they can be used in new Φtransaction.",
                "ΦConfirmation(s): Confirmation means a Φtransaction is packaged into a Φblock. Confirmations means how many Φblocks are created after a Φtransaction is confirmed (including the Φblock it's in).",
                "Φsignature: A digital signature created by a ΦID towards a message. It means the acknowledgement of the message from the ΦID owner. Φsignatures can be verified with the ΦID and the message.",
                "<div class='ph' />",
                "<h3>Security Warnings</h3>",
                "<b>ΦAccount : </b>",
                "Please properly backup your account file if you have Φcoins in it or want to keep using it.",
                "Be careful of using accounts unencrypted. There's possibility of private key leakage and consequence of coin loss or reputation loss. Also, if you leave your computer, your account maybe operated by others.",
                "If your account is encrypted with a password, please properly remember or store your password. If you forget the password, your coins in that account will be lost, and you cannot use that account to publish or chat anymore.",
                "If you decrypt an account, it will return to unencrypted state.",
                "If you unlock an account, the password will be stored in system for a while (unlock time), if you leave your computer within that time, your account maybe operated by others.",
                "<b>Anonymity : </b>",
                "When you want to keep anonymous on the Φ system, be careful of the followings:",
                "Do not publish text or pictures with location information or identificating information such as career/company information.",
                "Be aware of any unfamiliar links, because they may collect your IP information and find out where you are.",
                "A simple and effective solution is to create disposable accounts (remember to delete them after use) for anonymous actions in the Φ system.",
                "<b>Signatures :</b>",
                "Signing a message means you agree to the contents you sign, this action has the same effect as if you sign on a paper. So please read carefully on the message before you sign!",
                "<b>ΦTransactions :</b>",
                "All transactions accepted to Φdatabase are final. There're no ways to change them.",
                "If you send Φcoins to the wrong receiving address, it's nearly impossible to get the money back.",
                "Your publications and comments will be stored in the Φdatabase forever and can be seen by anyone in the world. Once published, they are uneditable!",
                "So, please double check and triple check your transactions before you click the send button!",
                "<b>ΦMessages :</b>",
                "Although your Φmessages cannot be decrypted by any 3rd party, anybody can find out which ΦID, when and how often you contacted.",
                "Your contact's private keys can decrypt messages between you and him/her. If their private key leaked, your messages will be leaked at the same time.",
                "To be safer, you and your contact can chat with \"disposable\" accounts.",
                "<b>ΦPurchase and Send Φcoins:</b>",
                "All payments have a potential risk of unfulfilled agreement. If the recipient is anonymous to you, it's nearly impossible to sue and get the money back. Be aware of this, and think about the consequence before you pay.",
                "<b>Offchain storage:</b>",
                "Exchange centers, banks and other services that require deposit of Φcoins to their account, take control of your Φcoin at the time you make the transfer. There's potential risk of losing your coin to hacking, stealing or false management.",
                "<b>Incoming  Φcoin:</b>",
                "Don't trust any unconfirmed incomings. Φtransactions can be overridden or hanging unconfirmed for long time."

            ]
        }
    }
}
