{
    
"First-run":{
    "name":"First-run",
    "text":[
     "Welcome to the exiting Φ world! Please confirm your Φclient is connected to Φnetwork and the blocks count is growing.(see instructions below)",
     "It needs 10-30 minutes for downloading initial data before you can browse Φ contents. During this time period, please have a look at the basic introductions for Φ system below."
    ]
},
"General":{
    "name":"General",
"text":[
"<h3>Functionalities:</h3>",
"The Φ system is designed to be next generation internet. So it is not surprising that the Desktop Client version 2.0 covers so many functionalities of different areas. Here is a basic introductions of the function modules:",
"<b>Browse contents:</b>",
	"You can browse contents published on Φ system in ΦBrowser page. You can follow someone and watch his latest publications.Personal blog page is also supported.",
"<b>Publish contents:</b>",
        "If you are willing to have your own footprint on the Φ system, use the publish functionalities on ΦBrowser or ΦPublisher. Text, files, links ,apps can all be published to Φ system. Sharing link and commenting on content are also supported.",
"<b>Chat:</b>",
       "If you want to communicate  with others personally on Φ system, use the ΦMessenger. All messages are encrypted and only can be viewed by sender and receiver.",
"<b>Get Φcoins:</b>",
      "Publication and chat on Φ system needs Φcoins to pay network fee. Simplest and cheapest way to get Φcoins is to mine some Φcoins by ΦMiner. Of course you can buy Φcoins from others.",
"<b>Manage Φcoins:</b>",
"     After you got Φcoins, you can view balance, transaction history and send Φcoins in ΦWallet .",
"<b>Sell and buy products:</b>",
    "You can publish products for selling or buy products using Φcoin in ΦShop.",
"<b>Account management:</b>",
     "Publishing contents, chating ,sending and receiving Φcoins, are all based on a Φaccount owned by use. Create ,encrypt, export your account with account functionalities in the \"Account\" menu.",
"<b>Domain management:</b>",
     "To make your blog/shop/ID more distinguishable , you need to own domains. Domain management button is under \"Account\" menu.",
"<b>Apps management:</b>",
"     You can download and upgrade apps in ΦApps page.",

"<h3>Working environment:</h3>",
"Internet access is MUST for working with Φ system .",
"It'd better to use a public IP address because you can link to more Φnodes and get latest Φ data faster.",
"It needs to connect to at least one node of the Φ network. (The connections count is shown on bottom-right of your client window). You can collect node IPs from friends or web search, then add nodes via the \"add node\" function in  Menu--Applications--Tools. ",
"It' better NOT putting your working directory  in the same disc with operating system. To change data dir, add -choosedatadir after FAI.exe command.",

"<h3>Terminologies:</h3>",
"Φ represents the FAI system,FAI technology.",
"φ is the symbol for Φcoins.φ1 means one Φcoin.",
"ΦID. a ΦID is the namekey(pubkey) of a Φaccount.It's a unique idenfication(no duplicate in the universe). It represents its owner(person ,organization ,or computer). ΦID is used for receiving Φcoins or messages.ΦID is normally 60 bytes long.",
"Φ account. a Φ account  consists a namekey(ID,or pubkey) and privatekey, and optional, a password which encrypts it. Each account has an independant account file.",
"Φ domain. The domains with extension .f or .fai, and works similar as ICANN domains on the Φsystem. But Φdomains are more flexible, it can be redirected to a ΦID or a Φlink.",
"Φtransaction. A batch of automatic-executing Φ commands signed by Φaccounts.A Φtransaction has a unique Φlink, and a unique ID called txid. A transaction includes a series of money inputs, and a series of outputs of money and contents.",
"Φminer/mining. Using computer calculating power to try confirming Φtransactions. For each successful confirmation, you will be awarded the network fees of the Φtransactions confirmed.",
"Φfee. The fee paid to Φnetwork for Φtransaction sent. Minimum fee rate is  φ1 per kilo bytes length.",
"Φblock. A batch of confirmed Φtransactions. Each Φblock has a unique Id called Φblock hash, and a Φblock time when it's created. ΦBlocks are created one by one, so each Φblock has a blockheight.",
"Φblock height. The serie number of a Φblock in the blockchain.",
"Φcoinbase. The Φtransaction to receive Φnetwork fees.",
"Φlink. A link which represents the content of an output of Φtransaction.The content can be retrieved easily by it's link. Template:fai:blockheight.ntx.nout,examples:0.0.1; fai:10000.1.",
"ΦLocktime. The time of Φcoins in a Φtransaction output locked before they can be used in new Φtransaction.",
"ΦConfirmation(s).Confirmation means a Φtransactions is packaged into a Φblock.Confirmations means how many Φblocks are created after a Φtransaction is confirmed(including the Φblock it's in).",
"Φsignature. A Φsignature is a digital signature created by a ΦID towards a message. It means the acknowledgement of the message from the ΦID owner. Φsignatures can be verified with the ΦID and the message.",

"<h3>Security Warnings</h3>",

"<b>ΦAccount:</b>",
"Please properly backup your account file if you have Φcoins in it or want to keep using it.",
"Be careful of using accounts unencrypted. There's possiblity of private key leakage and consequence of coin loss or reputation loss. Also, if you leave your computer, your account maybe operated by others.",
"If you encrypt an account with a password, please properly remember or store your password. If you forget the password, your coins in that account will be lost, and you can't use that account to publish or chat anymore.",
"if you decrypt an account, it will return to unencrypted state.",
"If you unlock an account, the password will be stored in system for a while(unlock time),if you leave your computer within that time, your account maybe operated by others.",
"<b>Anonymity:</b>",
"When you want to keep anonymous on the  Φ system , be careful of the followings:",
"don't publish text or pictures with location information or idenficating information such as career/company information.",
"Becareful of clicking unfamiliar links,because they may collect your IP information and find out where you are.",
"A simple and effective solution is, create disposable accounts(remember to delete them after use) for anonymous actions in the Φworld.",
"<b>Signatures:</b>",
"Signing a message means you agree to the meanings in it, this action has the same effect as if you sign on a paper. So please read carefully on the message before you sign!",
"<b>ΦTransactions:</b>",
"All transactions accepted to Φdatabase are final. There're no ways to change them.",
"If you send Φcoins to the wrong receiving address, it's nearly impossible to get the money back.",
"Your publications and comments will be stored in the Φdatabase forever and can be seen by anyone in the world, and once published, they are uneditable! ",
"So,please double check and triple check your transactions before you click the send button!",
"<b>ΦMessages:</b>",
"Though your Φmessages can't be decrypted by 3rd party, but everbody can findout whom and when and how often you contacted.",
"Your contact's private keys can access all the messages with them. If their private keys got leak, your messages will also be leaked.",
"To make safer, you and your contact can chat with 'disposable' accounts.",
"<b>ΦPurchase and Sending Φcoins:</b>",
"All payments has a potential risk of unfulfilled agreement. If the recipient is anonymous to you, it's nearly impossible to suit and get the money back. Be aware of this, and think about the consequence before you pay.",
"<b>Offchain storage:</b>",
"Exchange centers, banks and other services which needs deposit of Φcoins to there account, all means you lose control of your Φcoin, and there's big risk of losing them, because hacker stealing(or they steal by themselves and report stealth by hackers) is much easier than you think.",
"<b>Incomings:</b>",
"Don't trust any unconfirmed incomings. Because the Φtransactions can be overrided or hanging unconfirmed for long term."
]
}
}
