{
    "Home": {
        "name": "Home",
        "home": {
            "name": "Home",
            "text": [
                "<h1><b>Φ</b>--<b>F</b>ree <b>A</b>nonymous <b>I</b>nternet, upgrades internet by providing ultimate freedom and anonymity</h1>",
                "<div class='ph' />",
                "<h1>Ultimate <b>F</b>reedom</h1>",
                "<p>Can NEVER be deleted, locked, modified or censored</p>",
                "<p>Accessible from anywhere</p>",
                "<div class='ph' />",
                "<h1>Ultimate <b>A</b>nonymity</h1>",
                "<p>No real world personal data needed</p>",
                "<p>Footprint untraceable</p>",
                "<div class='ph' />",
                "<h1>Next generation <b>I</b>nternet infrastructure</h1>",
                "<p>Full compatibility to existing internet system</p>",
                "<p>Plenty of general purpose APIs enabling quick and powerful Apps development</p>",
                "<p>Open source to ensure safety and upgradability</p>",
                "<div class='ph' />",
                "<h1>Core Innovations :</h1>",
                "<div class='ph' />",
                "<h4>Φ Account</h4>",
                "<p>The Φ account system is based on asymmetric cryptography, specifically, ECDSA technology</p>",
                "<p>Each user can create a unique Φ account by himself/herself. A Φ account is a privatekey – namekey (publickey) pair. Namekey represents the Φ account, and digital signatures signed by private key proofs the control of the Φ account and triggers digital operations</p>",
                "<p>A Φ account is fully owned and controlled by the user only. No website, organization, or government is able to access your Φ accounts</p>",
                "<p>The absence of any link between Φ account and real world personal information ensures ultimate anonymity</p>",
                "<p>Φ account is free. The zero cost to create, possess, use and abandon as many Φ accounts as needed ensures ultimate freedom</p>",
                "<p>Φ accounts are compatible with all kinds of digital system and are extremely easy to implement. \"One account for any app\" will become true in the near future</p>",
                "<h4>Φ Network</h4>",
                "<p>Φ network system is based on P2P technology, aka decentralized network</p>",
                "<p>Φ network has no centers. Every node in the Φ network is equal. Users can communicate point-to-point, or broadcast and relay Φ information</p>",
                "<p>Because of the cascade spreading of Φ information in the Φ network, there's no way to block, censor or modify Φ information</p>",
                "<p>Also because of the cascade-spreading of Φ information in the Φ network, it's extremely difficult to track the origin of Φ information. Ultimate anonymity is ensured meanwhile</p>",
                "<p>Any digital device can join the Φ network by following the basic Φ network protocol. Many kinds of apps can run on Φ network, even without a server</p>",
                "<h4>Φ Database</h4>",
                "<p>The Φ database system is based on blockchain technology</p>",
                "<p>There's always only one valid version of Φ database in the whole network, while many node/digital devices keep a full copy of it</p>",
                "<p>No Φ information can be deleted, because every node in the Φ network has a full copy of the Φ database </p>",
                "<p>Φ information following Φ database rules will go into Φ database after confirmed by Φ miners. The Φ database rules strictly require digital signature from the sender of the Φ information, so that no one else can modify the Φ information, i.e. the Φ information will be stored in the Φ database as what it is forever. Because of the decentrality of miners, there’s no way to block any valid Φ information going into Φ database</p>",
                "<p>Because everybody has exactly the same copy of Φ database, there're no ways to know what data a user has browsed. Ultimate anonymity is ensured</p>",
                "<p>The Φ database is open for any kind of digital information, including not only text, image, video, but also programs, settings, operation commands, etc</p>",
                "<h4>Φ Currency</h4>",
                "<p>The Φ currency system is based on Bitcoin technology</p>",
                "<p>The Φ currency is published and distributed independently on Φ system. It has no relationship with traditional currencies, so it's independent from any traditional banking and financial system</p>",
                "<p>Any Φ account can receive and send Φ currency. Naturally, the Φ currency system inherits the freedom and anonymity of Φ account </p>",
                "<p>A unique advantage of Φ currency system is that, the currency transaction is processed together with information and operation commands on the Φ system. It is unimaginably easy for merchants or app developers to integrate currency functions into their programs<p>"
            ]
        }
    },
    "Screen-captures": {
        "name": "Screen-captures",
        "screen-captures": {
            "name": "Screen-captures",
            "text": [
                "<h3>Screen Captures</h3>",
                "<div class='ph'></div>",
                "<h4>Browser new content page</h4>",
                "<a href='../scr/new_en.PNG' target='_blank'><img src='../scr/new_en.jpg' /></a>",
                "<h4>Browser Hot content page</h4>",
                "<a href='../scr/hot_en.PNG' target='_blank'><img src='../scr/hot_en.jpg' /></a>",
                "<h4>Browser Follow page</h4>",
                "<a href='../scr/follow_en.PNG' target='_blank'><img src='../scr/follow_en.jpg' /></a>",
                "<h4>Browser Personal page</h4>",
                "<a href='../scr/mypage_en.PNG' target='_blank'><img src='../scr/mypage_en.jpg' /></a>",
                "<h4>Personal Homepage</h4>",
                "<a href='../scr/homepage_en.PNG' target='_blank'><img src='../scr/homepage_en.jpg' /></a>",
                "<h4>Messenger page</h4>",
                "<a href='../scr/messenger_en.PNG' target='_blank'><img src='../scr/messenger_en.PNG' /></a>",
                "<h4>Wallet Overview page</h4>",
                "<a href='../scr/wallet_en.PNG' target='_blank'><img src='../scr/wallet_en.PNG' /></a>",
                "<h4>Shop Overview page</h4>",
                "<a href='../scr/shop_overview_en.PNG' target='_blank'><img src='../scr/shop_overview_en.PNG' /></a>",
                "<h4>Shop product detail page</h4>",
                "<a href='../scr/shop_detail_en.PNG' target='_blank'><img src='../scr/shop_detail_en.jpg' /></a>",
                "<h4>Shop publish product page</h4>",
                "<a href='../scr/shop_sell_en.PNG' target='_blank'><img src='../scr/shop_sell_en.PNG' /></a>",
                "<h4>Miner page</h4>",
                "<a href='../scr/miner_en.PNG' target='_blank'><img src='../scr/miner_en.PNG' /></a>"
            ]
        }
    },
    "Downloads": {
        "name": "Downloads",
        "downloads": {
            "name": "Downloads (Newest version)",
            "text": [
                "<h3>Download Φ FAI client for windows</h3>",
                "<div class='ph'></div>",
                "<a href='../download/FAI_2.0.1.exe'>FAI_2.0.1.exe (27MB) Auto extract version</a>",
                "<a href='../download/FAI_2.0.1.zip'>FAI_2.0.1.zip (43MB)</a>"
            ]
        },
        "downloads-full": {
            "name": "Downloads (All versions)",
            "text": [
                "<h3>Download Φ FAI client for windows</h3>",
                "<a href='../download/FAI_2.0.0.exe'>FAI_2.0.0.exe (27MB) Auto extract version</a>",
                "<a href='../download/FAI_2.0.0.zip'>FAI_2.0.0.zip (40MB)</a>",
                "<div class='ph'></div>",
                "<a href='../download/FAI_2.0.1.exe'>FAI_2.0.1.exe (27MB) Auto extract version</a>",
                "<a href='../download/FAI_2.0.1.zip'>FAI_2.0.1.zip (43MB)</a>"
            ]
        }
    },
    "APIs": {
        "name": "APIs",
        "apis": {
            "name": "APIs",
            "text": [
                "API List"
            ]
        }
    },
    "Contact": {
        "name": "Contact us",
        "contact": {
            "name": "Contact us",
            "text": [
                "<p>Please feel free to contact us if you have any questions: <a href='mailto:fai03a6@gmx.com'>fai03a6@gmx.com</a></p>"
            ]
        }
    },
    "FreeCoin": {
        "name": "Free coin",
        "freecoin": {
            "name": "Free coin activity",
            "text": [
                "<p>If you want to publish content and don't know how to get coins, send your ID to  <a href='mailto:fai03a6@gmx.com'>fai03a6@gmx.com</a></p>",
                "<p>Any unique email address will get <b>φ10 free trial</b></p>",
                "<br>",
                "<p>If you publish any publicly visible content that make sense, your ID will get another <b>φ100-φ1000</b> as content reward</p>",
                "<br>",
                "<p>And you are always welcome to join mining Φ for free"

            ]
        }
    }
}
